Revit 2024 API
Asset.LibraryName Property
 Library name
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string LibraryName { get; }
Visual Basic
Public ReadOnly Property LibraryName As String
	Get
Visual C++
public:
property String^ LibraryName {
	String^ get ();
}
See Also
Asset Class
Autodesk.Revit.DB.Visual Namespace